using System;

namespace TasksApp.Tasks
{
	/// <summary>
	/// Задача 839 - "Всем известно"
	/// (Время: 1 сек. Память: 16 Мб Сложность: 14%)
	/// 
	/// Всем известно, что многие олимпиадные задачи начинаются со слов «Всем известно». Но мало кто знает,
	/// что начинающему программисту Паше такие задачи меньше всего нравятся.
	/// Потому что обычно после слов «всем известно» описывается такой факт, о котором он даже не догадывался.
	/// После очередной подобной задачи Паша решил проверить, а действительно ли всем известно, что сумма первых N нечетных чисел равняется N^2.
	///
	/// Для этого Паша провел опрос всех людей, попавшихся ему под руку в известной социальной сети.
	/// Результаты опроса он записал в текстовый файл. Он ставил цифру один, если человеку был действительно известен данный факт,
	/// в противном случае в файл записывался нуль. Все было хорошо, пока Паша не открыл файл и не ужаснулся, увидев длинную последовательность из единичек.
	/// Как же он теперь будет искать среди них нули?
	///
	/// Уже всем известно, что Паша – начинающий программист, поэтому для обработки результатов исследования он обратился к вам за помощью.
	/// 
	/// Входные данные
	/// Входной файл INPUT.TXT содержит непустую последовательность из нулей и единиц. Длина последовательности не превышает 10^4.
	/// 
	/// Выходные данные
	/// В выходной файл OUTPUT.TXT выведите слово «YES», если факт был известен всем опрошенным людям, и слово "NO" в противном случае.
	/// </summary>
	public static class Task0839 
    {
        public static void Main()
        {            
            GetInputData(out var input);

            var result = Solve(input);

            PrintResult(result);  
        }

        private static void GetInputData(out string input)
        {
	        input = Console.ReadLine();
        }

        public static bool Solve(string input)
        {
	        for (var i = 0; i < input.Length; i++)
	        {
		        if (input[i] == '0')
		        {
			        return false;
		        }
	        }

	        return true;
        }

        private static void PrintResult(bool result)
        {
            Console.WriteLine(result ? "YES" : "NO");
        }
    }
}